Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ2064DAA176.PIC
      <edc:SFRDef edc:_addr="0x1F8E601C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------------nnnnnnn" edc:cname="RNGCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="RNGCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCNT" edc:desc="" edc:mask="0x7f" edc:name="RCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E6024" edc:offset="0x1FDC"/>
      <edc:AdjustPoint edc:_addr="0x1F8E8000" edc:offset="0x2000"/>
      <edc:SFRDef edc:_addr="0x1F8EA000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="nn-nnn-nnnnn----------nnnnn-----" edc:cname="GLCDMODE" edc:desc="" edc:impl="0xddf003e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-000-00000----------00000-----" edc:name="GLCDMODE" edc:nzwidth="32" edc:por="00-000-00000----------00000-----" ltx:baseofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RGBSEQ" edc:desc="" edc:mask="0x7" edc:name="RGBSEQ" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="FORMATCLK" edc:desc="" edc:mask="0x1" edc:name="FORMATCLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="YUVOUTPUT" edc:desc="" edc:mask="0x1" edc:name="YUVOUTPUT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="FORCEBLANK" edc:desc="" edc:mask="0x1" edc:name="FORCEBLANK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PGRAMPEN" edc:desc="" edc:mask="0x1" edc:name="PGRAMPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PCLKPOL" edc:desc="" edc:mask="0x1" edc:name="PCLKPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VSYNCCYC" edc:desc="" edc:mask="0x1" edc:name="VSYNCCYC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="" edc:mask="0x1" edc:name="DITHER" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DEPOL" edc:desc="" edc:mask="0x1" edc:name="DEPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSYNCPOL" edc:desc="" edc:mask="0x1" edc:name="HSYNCPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VSYNCPOL" edc:desc="" edc:mask="0x1" edc:name="VSYNCPOL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CURSOREN" edc:desc="" edc:mask="0x1" edc:name="CURSOREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="------------------nnnnnn--nnnnnn" edc:cname="GLCDCLKCON" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="GLCDCLKCON" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="" edc:mask="0x3f" edc:name="CLKDIV" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LPREFETCH" edc:desc="" edc:mask="0x3f" edc:name="LPREFETCH" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA008" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDBGCOLOR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDBGCOLOR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALPHA" edc:desc="" edc:mask="0xff" edc:name="ALPHA" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA00C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDRES" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDRES" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="RESY" edc:desc="" edc:mask="0x7ff" edc:name="RESY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="RESX" edc:desc="" edc:mask="0x7ff" edc:name="RESX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8EA014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDFPORCH" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDFPORCH" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="FPORCHY" edc:desc="" edc:mask="0x7ff" edc:name="FPORCHY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="FPORCHX" edc:desc="" edc:mask="0x7ff" edc:name="FPORCHX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA018" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDBLANKING" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDBLANKING" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLANKINGY" edc:desc="" edc:mask="0x7ff" edc:name="BLANKINGY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="BLANKINGX" edc:desc="" edc:mask="0x7ff" edc:name="BLANKINGX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
